{
    "projects": [
        {
            "title": "Web Projects",
            "details": [
                {
                    "title": "SynOps Frontdoor",
                    "primary": "ReatJS & .Net Core",
                    "domain": "IT Operations",
                    "role": "Project Manager",
                    "responsibilities": [
                        "Managed end-to-end delivery for SynOps Frontdoor every 2 weeks",
                        "Planning requirements, resources, release etc. for each sprint",
                        "Providing Status update to leadership team to MD’s/AD’s",
                        "Support entire team on the development issues and business queries",
                        "Collaborate between Functional, Technical, Development & testing team to meet the timeline and milestones as planned",
                        "Managed 30+ Technical resources, interact with various forum to track and manage the deliverables",
                        "Also worked on Effort estimation, Environment management, Production Deployment, Performance etc. "

                    ]

                },
                {
                    "title": "Wynsure FullWeb",
                    "primary": "ReatJS & NodeJS",
                    "domain": "Insurance",
                    "role": "Project Lead",
                    "responsibilities": [
                        "Designed web pages based on UX design, customizing styles etc.",
                        "Created generic and custom components to enhance the web application.",
                        "Involved in Technical discussion to enable the product, Peer Review and code management using GIT.",
                        "Mentored new team members and provided technical/functional support.",
                        "Task tracking in JIRA, delivering day to day updates to the project management. "
                    ]
                },
                {
                    "title": "Design Workshop",
                    "primary": "ReatJS, Redux, & NodeJS",
                    "domain": "Insurance",
                    "role": "Project Lead",
                    "responsibilities": [
                        "Created Wire Frames using Confluence to come up with design layout for Design workshop tool.",
                        "Designed and developed various features of Design workshop tool like publication portal, translation portal etc.",
                        "Developed generic components to use across the application and presenting the tool to Business on end of each sprint.",
                        "Worked on Node API to manipulate the configuration and layout of the tool using JSON.",
                        "Incorporated Unit testing, peer review and code management using GitHub.",
                        "Mentored and provided technical support to team.",
                        "Deployment of the Application and incorporating changes requested by client."
                    ]
                },
                {
                    "title": "Front End Group Admin Project",
                    "primary": "ReatJS, Redux, ReactNative & NodeJS",
                    "domain": "Insurance",
                    "role": "Team Lead",
                    "responsibilities": [
                        "Developed Front end pages using React/React Native based on the JSON data retrieved using RestAPI.",
                        "Implemented generic components to use across the application",
                        "Unit tested the components using JEST, Flow Check and Continuous Integration.",
                        "Mentored and provided technical support to team.",
                        "Task Tracking  in JIRA, delivering day to day update to project management."
                    ]
                }
            ],
            "bgColor": "#f79b5c"
        },
        {
            "title": "Desktop Applications",
            "details": [
                {
                    "title": "MAX",
                    "primary": "eWAM/GOLD",
                    "domain": "Insurance",
                    "role": "Individual Contributor",
                    "responsibilities": [
                        "Enhanced the MAX system to support new/upcoming Employee Benefit insurance product.",
                        "Designed and developed the functional requirement and presenting to the Business on end of each sprint.",
                        "Performed Unit testing and Peer review. Tracking task in Version One.",
                        "Discussed the requirements with Business Analyst and come with functional/ technical Implementation.",
                        "Provided day to day update to Scrum Master."
                    ]
                },
                {
                    "title": "Wynsure Development",
                    "primary": "eWAM/GOLD",
                    "domain": "Insurance",
                    "role": "Project Lead",
                    "responsibilities": [
                        "Analyzed the customization on the product to fit Client requirement.",
                        " Gathered requirements, communicate with the Business Analysts, client, management for potential functional gaps and estimation of work.",
                        "Created low level Design, Coding & Testing",
                        "Supported on defect fixing on live Wynsure implemented in production",
                        "Performed independent role on Implementing functional gaps by customizing Wynsure"
                    ]
                },
                {
                    "title": "GPS (Global Purchasing System)",
                    "primary": "VC++ (MFC)",
                    "domain": "Manufacturing",
                    "role": "Team Lead",
                    "responsibilities": [
                        "Handled multiple phases of GPS from Estimation, Analyzing requirement, Design, Coding & Implementation.",
                        "Mentored and provided technical support to team.",
                        "Day to day project activities like task allocation, tracking requirement status etc.",
                        "Interacted with client through various forum for Queries, status update etc.",
                        "Provided support till application gets implemented in production server."
                    ]
                },
                {
                    "title": "MRI MPlus Integration ",
                    "primary": "VC++ (MFC)",
                    "domain": "Health Care",
                    "role": "Project Lead",
                    "responsibilities": [
                        "Installation and setup the application at onsite for every offshore delivery.",
                        "Testing and validating it before delivering it to Client.",
                        "Debug the source code and fix the defects if any major issues were identified while integration.",
                        "Interacting with client on major issues and find the solution for the same.",
                        "Modify the system according to the client requirement."
                    ]
                },
                {
                    "title": "MRI Acqman",
                    "primary": "VC++ (MFC)",
                    "domain": "Health Care",
                    "role": "Tech Lead",
                    "responsibilities": [
                        "Integrated the Acqman with the existing vantage system and also with Mplus components.",
                        "Debugged the source code and fixing the defects while integration.",
                        "Implementation and Testing with Actual MRI Scan Machine and fix issues.",
                        "Performed Acceptance testing with client and defect fixing during acceptance phase.",
                        "Incorporated Task allocation, Creating WBS, Estimation, Status monitoring and other day to day activities related to project management work."
                    ]
                }
            ],
            "bgColor": "#5b6789"
        }
    ]
}